In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('http://bit.ly/drinksbycountry')

In [3]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [4]:
df.drop('continent',axis=1).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [6]:
df.drop(['beer_servings','country'],axis=1,inplace=True)

In [7]:
df.head()

   spirit_servings  wine_servings  total_litres_of_pure_alcohol continent
0                0              0                           0.0      Asia
1              132             54                           4.9    Europe
2                0             14                           0.7    Africa
3              138            312                          12.4    Europe
4               57             45                           5.9    Africa

In [9]:
df.mean(axis=0)

spirit_servings                 80.994819
wine_servings                   49.450777
total_litres_of_pure_alcohol     4.717098
dtype: float64

In [10]:
df.mean(axis=0).shape

(3,)